cases/HydrogenFlame-Unsteady/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
1629
(
(0.103058591834 0 61.8568607756)
(-3.52306612745 0 61.7714338259)
(7.35466596509 0 57.2777975546)
(0.721760730358 3.22850847544e-16 64.2723030238)
(-2.96812632227 1.49090761276e-15 63.4430753841)
(4.3528764449 2.93993902638e-16 56.8223525839)
(0.831349282533 1.89521489189e-15 66.037010899)
(-2.74277727072 9.21266335418e-15 64.6030868006)
...
)
;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform (0 0 60);
    }
    inletair
    {
        type            fixedValue;
        value           uniform (0 0 2);
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    burnerwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
