cases/HydrogenFlame-Unsteady/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1629
(
4.85728238908e-10
1.14405384001e-09
3.85967291254e-09
6.10974820901e-08
2.41793671653e-07
1.28205380839e-06
4.52915987726e-06
2.83214114588e-05
...
)
;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform 0;
    }
    inletair
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            zeroGradient;
    }
    burnerwall
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
