cases/HydrogenFlame-Unsteady/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
1629
(
28960.2165048
110382.079101
839090.351492
45690.4209846
165913.277854
1336362.65659
56433.2706651
205480.587462
...
)
;

boundaryField
{
    inletfuel
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 1630.0935556;
    }
    inletair
    {
        type            compressible::turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        phi             phi;
        k               k;
        value           uniform 0.0603738353925;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           nonuniform List<scalar> 
26
(
48.0046373721
48.3604277003
49.0951171867
50.1035769145
52.2528294478
55.2021532248
58.4028994757
61.7137200439
...
)
;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
65
(
1.55121205759
2.84132914665
0.230337513997
0.241160759704
0.249778517587
2.84132914665
3.271647912
3.90608763485
...
)
;
    }
    burnerwall
    {
        type            compressible::epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 7(839090.351492 1336362.65659 1590810.68856 3.48312651 5.2535297357 10.4064779028 55909.5348969);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
