cases/HydrogenFlame-Unsteady/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1629
(
15.7675584857
21.8484439434
71.9320826148
16.8289781154
25.4897017072
98.099404336
17.3665562048
28.1019242664
...
)
;

boundaryField
{
    inletfuel
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 13.5;
    }
    inletair
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.015;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           nonuniform List<scalar> 
26
(
1.56754758643
1.56858548034
1.57088551441
1.57412944361
1.58144854451
1.5975974517
1.61885265494
1.64086197356
...
)
;
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 
65
(
0.0256072441022
0.0303770437913
0.0157204357912
0.0162091121256
0.0165929977178
0.0303770437913
0.033371483583
0.0375571355952
...
)
;
    }
    burnerwall
    {
        type            compressible::kqRWallFunction;
        value           nonuniform List<scalar> 7(71.9320826148 98.099404336 110.186693209 0.0348858134509 0.0458814165846 0.0723666607097 27.9408305745);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
